package lesson2;

public class Main4 {
    public static void main(String[] args) {
        // Циклы
        // for более широкое
        // while  более простой


        // Задача: напечатать на консоль 10 раз слово привет
        // for ( от скольки   ;  до скольки  ; шаг   )
        for (int i = 0; i < 10; i++)


            System.out.println("Привет!");
    }


}